<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"production","backend":"d7ef878a98b82cd1bf010fd812395b27dedca5f9c8239f64530bf45bc59af11a","plan_job_ref":"Job Pull Request Checks #3011 at https://github.com/GSA-TTS/FAC/actions/runs/9094156764","plan_out_hash":"db56ef9e9dac344e6c55e27273a5e35eee69ca27c1d7adfefdd9e506a1d7dc33","plan_hash":"5f5a9067cf2b62c87f3fe30354cd0bb5a55e75e088a587939f0dd6e3ade30110","plan_text_format":"diff","version":"1.42.0"} -->
Terraform plan for __production__
<details>
<summary>Plan: 8 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.production.cloudfoundry_app.postgrest will be updated in-place
!~  resource "cloudfoundry_app" "postgrest" {
!~      docker_image                    = "ghcr.io/gsa-tts/fac/postgrest@sha256:58a897e8349f3b6a13810ae87751295841f7da1ce68e5f12a18948538fa49837" -> "ghcr.io/gsa-tts/fac/postgrest@sha256:4b903ac223ea5f583bd870a328a3cf54d19267e5b5abfff896863b37f7cb68b6"
        id                              = "70ac44be-3507-4867-a75f-c2d1ab12ee89"
        name                            = "postgrest"
#        (17 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # module.production.cloudfoundry_network_policy.scanner-network-policy will be created
+   resource "cloudfoundry_network_policy" "scanner-network-policy" {
+       id = (known after apply)

+       policy {
+           destination_app = "5e81ca8b-99cf-41f8-ae42-76652d51a44c"
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

  # module.production.module.fac-file-scanner.cloudfoundry_app.scanner_app will be created
+   resource "cloudfoundry_app" "scanner_app" {
+       buildpack                       = "https://github.com/cloudfoundry/python-buildpack"
+       disk_quota                      = 512
+       enable_ssh                      = (known after apply)
+       environment                     = (sensitive value)
+       health_check_http_endpoint      = (known after apply)
+       health_check_invocation_timeout = (known after apply)
+       health_check_timeout            = (known after apply)
+       health_check_type               = "port"
+       id                              = (known after apply)
+       id_bg                           = (known after apply)
+       instances                       = 1
+       memory                          = 512
+       name                            = "fac-file-scanner"
+       path                            = "../shared/modules/scanner/scanner.zip"
+       ports                           = (known after apply)
+       space                           = "5593dba8-7023-49a5-bdbe-e809fe23edf9"
+       stack                           = (known after apply)
+       stopped                         = false
+       strategy                        = "rolling"
+       timeout                         = 180

+       routes {
+           port  = (known after apply)
+           route = (known after apply)
        }

+       service_binding {
+           service_instance = (known after apply)
        }
+       service_binding {
+           service_instance = "ac8bf271-4c6d-4ee0-bd36-1415b839a93c"
        }
+       service_binding {
+           service_instance = (known after apply)
        }
+       service_binding {
+           service_instance = "0eca29d3-e963-49e6-8c9e-c53b7aa8482e"
        }
    }

  # module.production.module.fac-file-scanner.cloudfoundry_route.scanner_route will be created
+   resource "cloudfoundry_route" "scanner_route" {
+       domain   = "26df58ef-0c0d-4997-b68b-8defb7b3998b"
+       endpoint = (known after apply)
+       hostname = "fac-file-scanner-production"
+       id       = (known after apply)
+       port     = (known after apply)
+       space    = "5593dba8-7023-49a5-bdbe-e809fe23edf9"
    }

  # module.production.module.fac-file-scanner.cloudfoundry_user_provided_service.clam will be created
+   resource "cloudfoundry_user_provided_service" "clam" {
+       credentials = (sensitive value)
+       id          = (known after apply)
+       name        = "clamav_ups"
+       space       = "5593dba8-7023-49a5-bdbe-e809fe23edf9"
    }

  # module.production.module.file_scanner_clamav.data.cloudfoundry_app.app will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_app" "app" {
+       buildpack                  = (known after apply)
+       command                    = (known after apply)
+       disk_quota                 = (known after apply)
+       enable_ssh                 = (known after apply)
+       environment                = (sensitive value)
+       health_check_http_endpoint = (known after apply)
+       health_check_timeout       = (known after apply)
+       health_check_type          = (known after apply)
+       id                         = (known after apply)
+       instances                  = (known after apply)
+       memory                     = (known after apply)
+       name                       = (known after apply)
+       name_or_id                 = "****************"
+       space                      = (known after apply)
+       stack                      = (known after apply)
+       state                      = (known after apply)
    }

  # module.production.module.file_scanner_clamav.data.cloudfoundry_domain.internal will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_domain" "internal" {
+       domain   = (known after apply)
+       id       = (known after apply)
+       internal = (known after apply)
+       name     = "apps.internal"
+       org      = (known after apply)
    }

  # module.production.module.file_scanner_clamav.data.cloudfoundry_space.space will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_space" "space" {
+       id       = (known after apply)
+       name     = "production"
+       org      = (known after apply)
+       org_name = "gsa-tts-oros-fac"
+       quota    = (known after apply)
    }

  # module.production.module.file_scanner_clamav.cloudfoundry_app.clamav_api will be created
+   resource "cloudfoundry_app" "clamav_api" {
+       buildpack                       = (known after apply)
+       disk_quota                      = 2048
+       docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:a6b645538b565528a5dba563be597d5d7c8fe162a4924b14048d50d117450cf8"
+       enable_ssh                      = (known after apply)
+       environment                     = (sensitive value)
+       health_check_http_endpoint      = (known after apply)
+       health_check_invocation_timeout = (known after apply)
+       health_check_timeout            = (known after apply)
+       health_check_type               = "port"
+       id                              = (known after apply)
+       id_bg                           = (known after apply)
+       instances                       = 8
+       memory                          = 3072
+       name                            = "fac-av-production-fs"
+       ports                           = (known after apply)
+       space                           = (known after apply)
+       stack                           = (known after apply)
+       stopped                         = false
+       strategy                        = "rolling"
+       timeout                         = 600

+       routes {
+           port  = (known after apply)
+           route = (known after apply)
        }
    }

  # module.production.module.file_scanner_clamav.cloudfoundry_network_policy.clamav_routing will be created
+   resource "cloudfoundry_network_policy" "clamav_routing" {
+       id = (known after apply)

+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

  # module.production.module.file_scanner_clamav.cloudfoundry_route.clamav_route will be created
+   resource "cloudfoundry_route" "clamav_route" {
+       domain   = (known after apply)
+       endpoint = (known after apply)
+       hostname = "fac-av-production-fs"
+       id       = (known after apply)
+       port     = (known after apply)
+       space    = (known after apply)
    }

  # module.production.module.fac-file-scanner.module.quarantine.cloudfoundry_service_instance.bucket will be created
+   resource "cloudfoundry_service_instance" "bucket" {
+       id                             = (known after apply)
+       name                           = "fac-file-scanner-quarantine"
+       replace_on_params_change       = false
+       replace_on_service_plan_change = false
+       service_plan                   = "021bb2a3-7e11-4fc2-b06b-d9f5938cd806"
+       space                          = "5593dba8-7023-49a5-bdbe-e809fe23edf9"
+       tags                           = [
+           "s3",
        ]
    }

Plan: 8 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.domain.cloudfoundry_service_instance.external_domain_instance,
  on /tmp/terraform-data-dir/modules/domain/domain/main.tf line 45, in resource "cloudfoundry_service_instance" "external_domain_instance":
  45:   recursive_delete = var.recursive_delete

Since CF API v3, recursive delete is always done on the cloudcontroller side.
This will be removed in future releases

(and 5 more similar warnings elsewhere)
```
</details>

:memo: Plan generated in [Pull Request Checks #3011](https://github.com/GSA-TTS/FAC/actions/runs/9094156764)